       01 REG-PRODUTO.
          05 PROD-ID        PIC 9(05).
          05 PROD-NOME      PIC X(30).
          05 PROD-QTD       PIC 9(04).
          05 PROD-PRECO     PIC 9(07)V99.
          05 PROD-CAT       PIC X(15).
